ezequieldonhauser/PIC18F452_ENC28J60/Microchip/TCPIP Stack/SPIFlash.c
  Remarks:
    See Remarks in SPIFlashBeginWrite for important information about Flash
    memory parts.
  ***************************************************************************/
void SPIFlashWrite(BYTE vData)
{
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif

    // Save SPI state (clock speed)
    SPICON1Save = SPIFLASH_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIFLASH_SPICON1 = PROPER_SPICON1;
    SPI_ON_BIT = 1;

    // If address is a boundary, erase a sector first
    if((dwWriteAddr & SPI_FLASH_SECTOR_MASK) == 0)
        SPIFlashEraseSector(dwWriteAddr);

    // Enable writing
    _SendCmd(WREN);

    // Activate the chip select
    SPIFLASH_CS_IO = 0;
    ClearSPIDoneFlag();

    // Issue WRITE command with address
    SPIFLASH_SSPBUF = WRITE;
    WaitForDataByte();
    Dummy = SPIFLASH_SSPBUF;

    SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[2];
    WaitForDataByte();
    Dummy = SPIFLASH_SSPBUF;

    SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[1];
    WaitForDataByte();
    Dummy = SPIFLASH_SSPBUF;

    SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[0];
    WaitForDataByte();
    Dummy = SPIFLASH_SSPBUF;

    // Write the byte
    SPIFLASH_SSPBUF = vData;
    WaitForDataByte();
    Dummy = SPIFLASH_SSPBUF;
    dwWriteAddr++;

    // Deactivate chip select and wait for write to complete
    SPIFLASH_CS_IO = 1;
    _WaitWhileBusy();

    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIFLASH_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}

/*****************************************************************************
  Function:
    void SPIFlashWriteArray(BYTE* vData, WORD wLen)

  Summary:
    Writes an array of bytes to the SPI Flash part.

  Description:
    This function writes an array of bytes to the SPI Flash part.  When the
    address pointer crosses a sector boundary (and has more data to write),
    the next sector will automatically be erased.  If the current address
    pointer indicates an address that is not a sector boundary and is not
    already erased, the chip will silently ignore the write command until the
    next sector boundary is crossed.

  Precondition:
    SPIFlashInit and SPIFlashBeginWrite have been called, and the current
    address is either the front of a sector or has already been erased.

  Parameters:
    vData - The array to write to the next memory location
    wLen - The length of the data to be written

  Returns:
    None

  Remarks:
    See Remarks in SPIFlashBeginWrite for important information about Flash
    memory parts.
  ***************************************************************************/
void SPIFlashWriteArray(BYTE* vData, WORD wLen)
{
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif
    BOOL isStarted;

    // Save SPI state (clock speed)
    SPICON1Save = SPIFLASH_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIFLASH_SPICON1 = PROPER_SPICON1;
    SPI_ON_BIT = 1;

    #if defined(SPI_FLASH_SST)
        // If starting at an odd address, write a single byte
        if((dwWriteAddr & 0x01) && wLen)
        {
            SPIFlashWrite(*vData);
            vData++;
            wLen--;
        }

        isStarted = FALSE;

        // Loop over all remaining WORDs
        while(wLen > 1)
        {
            // Don't do anything until chip is ready
            _WaitWhileBusy();

            // If address is a sector boundary
            if((dwWriteAddr & SPI_FLASH_SECTOR_MASK) == 0)
                SPIFlashEraseSector(dwWriteAddr);

            // If not yet started, initiate AAI mode
            if(!isStarted)
            {
                // Enable writing
                _SendCmd(WREN);

                // Activate the chip select
                SPIFLASH_CS_IO = 0;
                ClearSPIDoneFlag();

                // Issue WRITE_STREAM command with address
                SPIFLASH_SSPBUF = WRITE_STREAM;
                WaitForDataByte();
                Dummy = SPIFLASH_SSPBUF;

                SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[2];
                WaitForDataByte();
                Dummy = SPIFLASH_SSPBUF;

                SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[1];
                WaitForDataByte();
                Dummy = SPIFLASH_SSPBUF;

                SPIFLASH_SSPBUF = ((BYTE*)&dwWriteAddr)[0];
                WaitForDataByte();
                Dummy = SPIFLASH_SSPBUF;

                isStarted = TRUE;
            }
            // Otherwise, just write the AAI command again
            else
            {
                // Assert the chip select pin
                SPIFLASH_CS_IO = 0;
                ClearSPIDoneFlag();

                // Issue the WRITE_STREAM command for continuation
                SPIFLASH_SSPBUF = WRITE_STREAM;
                WaitForDataByte();
                Dummy = SPIFLASH_SSPBUF;
            }

            // Write the two bytes
            SPIFLASH_SSPBUF = *vData++;
            WaitForDataByte();
            Dummy = SPIFLASH_SSPBUF;

            SPIFLASH_SSPBUF = *vData++;
            WaitForDataByte();
            Dummy = SPIFLASH_SSPBUF;

            // Release the chip select to begin the write
            SPIFLASH_CS_IO = 1;

            // Increment the address, decrement length
            dwWriteAddr += 2;
            wLen -= 2;

            // If a boundary was reached, end the write
            if((dwWriteAddr & SPI_FLASH_SECTOR_MASK) == 0)
            {
                _WaitWhileBusy();
                _SendCmd(WRDI);
                isStarted = FALSE;
            }
        }

        // Wait for write to complete, then exit AAI mode
        _WaitWhileBusy();
        _SendCmd(WRDI);

        // If a byte remains, write the odd address
        if(wLen)
            SPIFlashWrite(*vData);

    #elif defined(SPI_FLASH_SPANSION)

